# 20200320
# 王兴浩
animal = ["企鹅","信天翁","鸵鸟","斑马","长颈鹿","虎","金钱豹"]
feature = ["有毛发","有奶","有羽毛","会飞","下蛋","吃肉","犀利牙齿","有爪","眼睛前视","有蹄","反刍动物","黄褐色","暗斑",
          "黑条纹","长脖子","长腿","不会飞","会游泳","黑白色","善飞","哺乳动物","鸟","食用动物","有蹄类",
          "企鹅","信天翁","鸵鸟","斑马","长颈鹿","虎","豹"]
          # 0 - 12
          # 13 - 23
          # 24 - 30
class Rule :
  evidence = [0, 0, 0, 0, 0, 0]
  result = 0
  def __init__(self,e ,re) :
    self.evidence = e
    self.result = re
  def make_rule(self, e, re):
    self.evidence = e
    self.result = re
r = []
rule = [([0],20),([1],20),([2],21),([3,4],21),([5],22),
		([6,7,8],22),([20,9],23),([20,10],23),([20,22,11,12],30),
		([20,22,11,13],29),([23,14,15,12],28),([23,13],27),
		([21,14,15,16,18],26),([21,19],25),([21,17,18,16],24)]
def Add_rule():
  c = 0
  for i in rule:
    tmp = Rule(i[0], i[1])
    r.append(tmp)
    c += 1

def Show_feature() :
  c = 0
  for i in feature :
    print(c,".",i)
    c += 1
if __name__ == "__main__":
  Add_rule()